# Проект FitLife - MVP версия 1.0

# Объявляем константы WATER_REP_KG (норма воды в миллилитрах на киллограм)
# и ML_IN_LITRES (количество миллилитров в литре).
WATER_REP_KG = 30
ML_IN_LITRES = 1000

# 1. Знакомство
# Запрашиваем имя пользователя, преобразуем регистр символов
# и убираем лишние пробелы. Сохраняем в переменную user_name.
user_name = input("Привет! Как тебя зовут? ").strip().title()

# Запрашиваем возраст пользователя.
# Проверяем корректность введенного значения (введено число,
# диапазон введенного значения).
# Введенное значение преобразуем в чило и сохраняем в переменную user_age.
while True:
    try:
        user_age = int(input(
            f"Очень приятно, {user_name}! "
            "Сколько тебе полных лет? "
        ))
        if 0 < user_age <= 130:
            break
        else:
            print("Возраст введен некорректно!")
    except ValueError:
        print("Возраст введен некорректно! Укажите возраст цифрами.")

# 2. Сбор данных
# Запрашиваем вес пользователя в килограммах. При наличии "," меняем на ".".
# Проверяем корректность введенного значения (введено число,
# диапазон введенного значения).
# Введенное значение преобразуем в чило с плавающей точкой
# и сохраняем в переменную user_weight.
while True:
    try:
        user_weight = float(input(
            "Укажи свой вес в килограммах (пример: 75.5): "
        ).replace(',', '.'))
        if 0 < user_weight <= 650:
            break
        else:
            print("Вес введен некорректно!")
    except ValueError:
        print("Вес введен некорректно! Укажите вес цифрами.")

# Запрашиваем рост пользователя в метрах. При наличии "," меняем на ".".
# Проверяем корректность введенного значения (введено число,
# диапазон введенного значения).
# Введенное значение преобразуем в чило с плавающей точкой
# и сохраняем в переменную user_height.
while True:
    try:
        user_height = float(input(
            "Укажи, пожалуйста, свой рост в метрах (пример: 1.55): "
        ).replace(',', '.'))
        if 0 < user_height <= 3:
            break
        else:
            print("Рост введен некорректно!")
    except ValueError:
        print("Рост введен некорректно! Укажите рост цифрами.")

# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
# Рассчитываем bmi (Индекс массы тела)
# и округляем его до одного знака после запятой.
bmi = round(user_weight / user_height ** 2, 1)

# Расчитываем суточную норму воды, исходя из веса.
water_needed = user_weight * WATER_REP_KG / ML_IN_LITRES

# 4. Вывод красивого результата
# Выводим результаты расчетов с использованием f-строк, оформляем символом "*"
# При выводе нормы воды округляем значение до одного знака после запятой.
print(
    f"{'*' * 50}\n"
    f"Отчет для пользователя: {user_name} ({user_age} лет)\n"
    f"Твой Индекс Массы Тела: {bmi}\n"
    f"Рекомендуемая норма воды: {water_needed:.1f} литра в день.\n"
    f"{'*' * 50}\n"
    "Расчет окончен. Будьте здоровы!",
)
